dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/EVENTLP_1.0.xml
        <register id="EVENTLP_DIAGPAR184" width="32" offset="0x10C" description="Diagnostic Parity Register 184">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR183" width="32" offset="0x110" description="Diagnostic Parity Register 183">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR182" width="32" offset="0x114" description="Diagnostic Parity Register 182">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR181" width="32" offset="0x118" description="Diagnostic Parity Register 181">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR180" width="32" offset="0x11C" description="Diagnostic Parity Register 180">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR179" width="32" offset="0x120" description="Diagnostic Parity Register 179">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR178" width="32" offset="0x124" description="Diagnostic Parity Register 178">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR177" width="32" offset="0x128" description="Diagnostic Parity Register 177">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR176" width="32" offset="0x12C" description="Diagnostic Parity Register 176">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR175" width="32" offset="0x130" description="Diagnostic Parity Register 175">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR174" width="32" offset="0x134" description="Diagnostic Parity Register 174">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR173" width="32" offset="0x138" description="Diagnostic Parity Register 173">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR172" width="32" offset="0x13C" description="Diagnostic Parity Register 172">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
