dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/EVENTLP_1.0.xml
        <register id="EVENTLP_DIAGPAR128" width="32" offset="0x1EC" description="Diagnostic Parity Register 128">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR127" width="32" offset="0x1F0" description="Diagnostic Parity Register 127">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR126" width="32" offset="0x1F4" description="Diagnostic Parity Register 126">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR125" width="32" offset="0x1F8" description="Diagnostic Parity Register 125">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR124" width="32" offset="0x1FC" description="Diagnostic Parity Register 124">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR123" width="32" offset="0x200" description="Diagnostic Parity Register 123">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR122" width="32" offset="0x204" description="Diagnostic Parity Register 122">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR121" width="32" offset="0x208" description="Diagnostic Parity Register 121">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR120" width="32" offset="0x20C" description="Diagnostic Parity Register 120">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR119" width="32" offset="0x210" description="Diagnostic Parity Register 119">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR118" width="32" offset="0x214" description="Diagnostic Parity Register 118">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR117" width="32" offset="0x218" description="Diagnostic Parity Register 117">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR116" width="32" offset="0x21C" description="Diagnostic Parity Register 116">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR115" width="32" offset="0x220" description="Diagnostic Parity Register 115">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR114" width="32" offset="0x224" description="Diagnostic Parity Register 114">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR113" width="32" offset="0x228" description="Diagnostic Parity Register 113">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR112" width="32" offset="0x22C" description="Diagnostic Parity Register 112">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
