dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/EVENTLP_1.0.xml
        <register id="EVENTLP_DIAGPAR111" width="32" offset="0x230" description="Diagnostic Parity Register 111">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR110" width="32" offset="0x234" description="Diagnostic Parity Register 110">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR109" width="32" offset="0x238" description="Diagnostic Parity Register 109">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR108" width="32" offset="0x23C" description="Diagnostic Parity Register 108">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR107" width="32" offset="0x240" description="Diagnostic Parity Register 107">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR106" width="32" offset="0x244" description="Diagnostic Parity Register 106">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR105" width="32" offset="0x248" description="Diagnostic Parity Register 105">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR104" width="32" offset="0x24C" description="Diagnostic Parity Register 104">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR103" width="32" offset="0x250" description="Diagnostic Parity Register 103">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR102" width="32" offset="0x254" description="Diagnostic Parity Register 102">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR101" width="32" offset="0x258" description="Diagnostic Parity Register 101">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR100" width="32" offset="0x25C" description="Diagnostic Parity Register 100">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR99" width="32" offset="0x260" description="Diagnostic Parity Register 99">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR98" width="32" offset="0x264" description="Diagnostic Parity Register 98">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR97" width="32" offset="0x268" description="Diagnostic Parity Register 97">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR96" width="32" offset="0x26C" description="Diagnostic Parity Register 96">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR95" width="32" offset="0x270" description="Diagnostic Parity Register 95">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR94" width="32" offset="0x274" description="Diagnostic Parity Register 94">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
