dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/EVENTLP_1.0.xml
        <register id="EVENTLP_DIAGPAR8" width="32" offset="0x3CC" description="Diagnostic Parity Register 8">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR7" width="32" offset="0x3D0" description="Diagnostic Parity Register 7">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR6" width="32" offset="0x3D4" description="Diagnostic Parity Register 6">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR5" width="32" offset="0x3D8" description="Diagnostic Parity Register 5">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR4" width="32" offset="0x3DC" description="Diagnostic Parity Register 4">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR3" width="32" offset="0x3E0" description="Diagnostic Parity Register 3">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR2" width="32" offset="0x3E4" description="Diagnostic Parity Register 2">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR1" width="32" offset="0x3E8" description="Diagnostic Parity Register 1">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR0" width="32" offset="0x3EC" description="Diagnostic Parity Register 0">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGIFRST" width="32" offset="0x3F4" description="Diagnostic Interface Reset Register">
            <bitfield id="ASSERTIFRST" description="Writing a 1 will synchronously clear the Diagnostic Interface. The STICKY bits for status and well as the PARFV will be cleared. If a true functional failure still exists, the interface will re-assert FUNCFAIL on the cycle following the interface reset" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="CLR" value="0x1" description="Clear"/>
            </bitfield>
            <bitfield id="DIAGPASSCLR" description="Writing a 1 will synchronously clear the PARFV MMR DPINDEX field. The STICKY bit for DIAGPASS status will be cleared as well." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="CLR" value="0x1" description="Clear"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPARFV" width="32" offset="0x3F8" description="Diagnostic Parity Fail Vector Register">
            <bitfield id="INDEX" description="Index of DIAG MMR creating the failure. NOTE: INDEX value of 1 corresponds to DIAGPAR0, 2 corresponds to DIAGPAR1 and so on." begin="9" end="0" width="10" rwaccess="R/W">
            </bitfield>
            <bitfield id="DPINDEX" description="Index of DIAG PASS MMR. NOTE: DPINDEX value of 1 corresponds to DIAGPAR0, 2 corresponds to DIAGPAR1 and so on." begin="25" end="16" width="10" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGSTAT" width="32" offset="0x3FC" description="Diagnostic Status Register">
            <bitfield id="STATE" description="Current diagnostic state" begin="2" end="0" width="3" rwaccess="R/W">
                <bitenum id="NONE" value="0x0" description="No failures and no diagnostic"/>
                <bitenum id="FUNC_FAIL" value="0x1" description="Functional Failure"/>
                <bitenum id="DIAG_FAIL" value="0x2" description="Diagnostic Failure"/>
                <bitenum id="DIAG_PASS" value="0x4" description="Diagnostic Pass"/>
            </bitfield>
            <bitfield id="NUMDIAG" description="This is a hardware constant that indicates how many DIAGPAR registers are included in this SFTYDIAG sub-region." begin="25" end="16" width="10" rwaccess="R/W">
            </bitfield>
        </register>
        </group>
    <group id="EVENTLP_IMPEXPCFG_EXPORT" name="EVENTLP_IMPEXPCFG_EXPORT" instances="1" offset="0x2000" instaddr="0x4" description="">
        <register id="EVENTLP_IMPEXPCFG_EXPORT_PORT" width="32" offset="0x0" description="Export channel ID register">
            <bitfield id="CHANID" description="Channel ID for import side to connect to" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value -- 0 has no effect"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum value -- check your device datasheet for actual maximum"/>
            </bitfield>
        </register>
        </group>
    <group id="EVENTLP_IMPEXPCFG_IMPORT" name="EVENTLP_IMPEXPCFG_IMPORT" instances="1" offset="0x2200" instaddr="0x4" description="">
        <register id="EVENTLP_IMPEXPCFG_IMPORT_PORT" width="32" offset="0x0" description="Import channel ID registe">
            <bitfield id="CHANID" description="Channel ID for import side to connect to" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value -- 0 has no effect"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum value -- check your device datasheet for actual maximum"/>
            </bitfield>
        </register>
        </group>

</module>